import { component$ } from '@builder.io/qwik';
import { useVisible } from '~/hooks';
import css from './Info.module.scss';
import map from 'lodash/map';

const infoList = [
  {
    title: '입장 가능 시간',
    content:
      '컨퍼런스가 진행되는 롯데타워 31층 입장은 세션 시작 1시간 전인 12시부터 가능합니다. 후원사에서 준비한 부스에 방문해보세요.',
  },
  {
    title: '라이브 스트리밍',
    content:
      '티켓을 구매하지 못했다고 너무 슬퍼하지 마세요. FEConf 2023의 모든 세션은 유투브에서 라이브 스트리밍으로 동시에 송출되며, 종료 후 FEConf 유투브 채널에서도 업로드 예정입니다.',
  },
];

const Info = component$(() => {
  const { visible } = useVisible();
  return (
    <ul class={css.list}>
      {map(infoList, ({ title, content }, key) => (
        <li key={key}>
          <div
            class={[css.info, 'fadeInRightSlide', { visible }]}
            style={{ transitionDelay: `${(key + 1) * 100}ms` }}
          >
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="14"
              height="14"
              viewBox="0 0 14 14"
            >
              <path
                d="M3.89008 7.72949C2.60091 7.72949 1.55675 8.77366 1.55675 10.0628C1.55675 11.352 2.60091 12.3962 3.89008 12.3962C5.17925 12.3962 6.22342 11.352 6.22342 10.0628C6.22342 8.77366 5.17925 7.72949 3.89008 7.72949ZM7.37842 8.31283V11.8128C7.37842 12.1337 7.64091 12.3962 7.96175 12.3962H11.4617C11.7826 12.3962 12.0451 12.1337 12.0451 11.8128V8.31283C12.0451 7.99199 11.7826 7.72949 11.4617 7.72949H7.96175C7.64091 7.72949 7.37842 7.99199 7.37842 8.31283ZM3.37091 2.22866L1.44591 5.69366C1.23008 6.08449 1.51008 6.56283 1.95341 6.56283H5.80341C6.24675 6.56283 6.52675 6.08449 6.31091 5.69366L4.38591 2.22866C4.16425 1.83199 3.59258 1.83199 3.37091 2.22866ZM11.0242 1.60449C10.4059 1.60449 9.96842 1.93116 9.71175 2.28699C9.45508 1.93116 9.01758 1.60449 8.39925 1.60449C7.48925 1.60449 6.79508 2.35116 6.79508 3.20866C6.79508 4.27616 7.97925 5.05783 9.33258 6.23033C9.54842 6.41699 9.86925 6.41699 10.0909 6.23033C11.4442 5.05783 12.6284 4.27616 12.6284 3.20866C12.6284 2.35116 11.9342 1.60449 11.0242 1.60449Z"
                fill="white"
              />
            </svg>
            <div class={css.title}>{title}</div>
          </div>
          <p
            class={[css.content, 'fadeInRightSlide', { visible }]}
            style={{ transitionDelay: `${(key + 1) * 100 + 100}ms` }}
          >
            {content}
          </p>
        </li>
      ))}
    </ul>
  );
});

export default Info;
